base/Documents/бит_УстановкаЗависимыхОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_УстановкаЗависимыхОборотов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ЗависимыеОбороты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьКоэффициентаСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийУстановкиЗависимыхОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависимыйСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеОбороты</Name>
					<Comment>Зависимые обороты</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО_Зависимый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов_Зависимый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7_Зависимый</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8_Зависимый</Name>
							<Comment>Дополнительная аналитика № 8 зависимая</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9_Зависимый</Name>
							<Comment>Дополнительная аналитика № 9 зависимая</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10_Зависимый</Name>
							<Comment>Дополнительная аналитика № 10 зависимая</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11_Зависимый</Name>
							<Comment>Дополнительная аналитика № 11 зависимая</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12_Зависимый</Name>
							<Comment>Дополнительная аналитика № 12 зависимая</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрофильРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПрофилиРаспределенияПоПериодам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>9</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитКоличество</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_РеквизитыДляРасчетаЗависимостей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСумма</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_РеквизитыДляРасчетаЗависимостей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияКоличество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПользовательскиеФункции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияСумма</Name>
							<Comment>Функция сумма</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПользовательскиеФункции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД_Родитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_ВидыОперацийУстановкиЗависимыхОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийУстановкиЗависимыхОборотов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗависимыеОборотыСценария</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеНаДругомСценарии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_УстановкаЗависимыхОборотов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте 
Перем мТекФункции; // Хранит текущие значения функций. Клиент.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли; 
	
	ЗаполнитьКэшЗначений();
	
	// Подготовка параметров, необходимых для отображения доп. измерений.
	СоответствиеИмен = Новый Соответствие;
	Для каждого ТекЭлемент Из КэшЗначений.ИзмеренияДоп Цикл
		СтруктураИмен = Новый Структура("ИмяПоля, Префикс, Постфикс", "ЗависимыеОбороты" + ТекЭлемент.Ключ + "_Зависимый", "", " зависимый");
		СоответствиеИмен.Вставить(ТекЭлемент.Ключ, СтруктураИмен);
	КонецЦикла;
	
	// Элементы управления для измерений несуществующих в смежном решении	
	// создаются программно для унификации кода.
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправленияУстановкаЗависимыхОборотов(Элементы);
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправленияУстановкаЗависимыхОборотовДеревоЗависимостей(Элементы, ЭтотОбъект);
	
	// Отображение дополнительных измерений в табличных полях.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, 
		"ДеревоЗависимостей", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"ЗависимыеОбороты", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"ЗависимыеОбороты", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений, СоответствиеИмен);		
	
	// Установить активный реквизит.
	СтруктураРеквизитов = Новый Структура("Сценарий");
	бит_РаботаСДиалогамиСервер.АктивизироватьРеквизитВФорме(Объект, ЭтотОбъект, СтруктураРеквизитов);
	
	// Структуры соответствия реквизитов дерева и табличной части.
	ЗаполнитьСтруктурыРеквизитов();
	
	ОбновитьДеревоЗависимостей();
	
	// При необходимости позиционируемся на указанной строке;
	Инд = Параметры.НомерТекущейСтроки - 1;
	Если Инд >= 0 И Инд <= Объект.ЗависимыеОбороты.Количество()-1 Тогда 		
		СтрокаТаблицы = Объект.ЗависимыеОбороты[Инд];  		
		ВеткаДерева = ДеревоЗависимостей.ПолучитьЭлементы();
		ИдентификаторСтроки = НайтиСтрокуДерева(ВеткаДерева, СтрокаТаблицы.ИД);
		Если ИдентификаторСтроки <> Неопределено Тогда
			Элементы.ДеревоЗависимостей.ТекущаяСтрока = ИдентификаторСтроки;
		КонецЕсли;		
	КонецЕсли;
	
	// Оформление таблиц.
	ОФормитьТаблицу("ДеревоЗависимостей");
	
	УстановитьФорматКоэффициентаСуммы();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	                     
	мТекФункции = Новый Структура;
	мТекФункции.Вставить("ФункцияСумма"		, КэшЗначений.ПустаяФункция);
	мТекФункции.Вставить("ФункцияКоличество", КэшЗначений.ПустаяФункция);
	
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоЗависимостей, ДеревоЗависимостей.ПолучитьЭлементы(), Истина);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбратьПериодЗавершение" И Источник = УникальныйИдентификатор Тогда	
		РедактированиеПериодаЗавершение(Параметр.Результат, Неопределено);
	ИначеЕсли ИмяСобытия = "Запись_СтатьиОборотов" Тогда
		ОбработатьоповещениеОбИзмененииСтатьиОборотов(Источник);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_УстановкаЗависимыхОборотов";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	ЗаполнитьДобавленныеКолонкиТаблиц();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьКоэффициентыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиКРедактированиюКоэффицентов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьКоэффициентаСуммыПриИзменении(Элемент)
	
	УстановитьФорматКоэффициентаСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЗначений

&НаКлиенте
Процедура ДеревоЗависимостейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДеревоЗависимостейКодификатор ИЛИ Поле = Элементы.ДеревоЗависимостейТипСтатьиОборотов Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекУровеньСтроки = ТекущиеДанные.УровеньСтроки;
		Отказ = Истина;
		Если Не (ТекУровеньСтроки = 0 И Копирование) Тогда 		
			Если Копирование Тогда
				СкопироватьСтрокуДерева(ТекущиеДанные.ПолучитьИдентификатор());
			Иначе
				
				ВеткаДерева = ТекущиеДанные.ПолучитьЭлементы();
				НоваяСтрока = ВеткаДерева.Добавить(); 				
				НовИдентификатор = НоваяСтрока.ПолучитьИдентификатор();
				
				НоваяСтрока.УровеньСтроки = ТекУровеньСтроки + 1;
				УстановитьНовыйИд(НовИдентификатор);
				Элементы.ДеревоЗависимостей.ТекущаяСтрока = НовИдентификатор;
				ЗаполнитьСтрокуЗависимыхОборотов(НовИдентификатор);
				
			КонецЕсли;
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
	Если Копирование Тогда
		бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоЗависимостей ,ДеревоЗависимостей.ПолучитьЭлементы() ,Истина);
	КонецЕсли; 

	
КонецПроцедуры

// Процедура выполняет копирование строки дерева с подчиненными строками. 
// 
// Параметры:
//  ИдСтроки - Число
// 
&НаСервере
Процедура СкопироватьСтрокуДерева(Знач ИдСтроки)
	
	ТекущаяСтрока = ДеревоЗависимостей.НайтиПоИдентификатору(ИдСтроки);
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		СтрокаРодитель = ТекущаяСтрока.ПолучитьРодителя();
		Если НЕ СтрокаРодитель = Неопределено Тогда
			
			// Копирование текущей строки.
			ТекущаяКоллекция = СтрокаРодитель.ПолучитьЭлементы();
			
			НоваяСтрока = ТекущаяКоллекция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			НовИд = НоваяСтрока.ПолучитьИдентификатор();
			УстановитьНовыйИд(НовИд);
			ЗаполнитьСтрокуЗависимыхОборотов(НовИд);
			
			Элементы.ДеревоЗависимостей.ТекущаяСтрока = НовИд;			
			
			// Копирование подчиненных строк.
			СкопироватьПодчиненныеСтроки(ТекущаяСтрока, НоваяСтрока);
			
		КонецЕсли; 
	КонецЕсли; 
	
	
КонецПроцедуры

// Процедура выполняет копирование подчиненных строк дерева. 
// 
// Параметры:
//  СтрокаИсточник - ДанныеФормыЭлементДерева.
//  СтрокаПриемник - ДанныеФормыЭлементДерева.
// 
&НаСервере
Процедура СкопироватьПодчиненныеСтроки(СтрокаИсточник, СтрокаПриемник)

	КоллекцияИсточник = СтрокаИсточник.ПолучитьЭлементы();
	КоллекцияПриемник = СтрокаПриемник.ПолучитьЭлементы();
	Для каждого ТекСтрока Из КоллекцияИсточник Цикл
		НоваяСтрока = КоллекцияПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		УстановитьНовыйИд(НоваяСтрока.ПолучитьИдентификатор());
		ЗаполнитьСтрокуЗависимыхОборотов(НоваяСтрока.ПолучитьИдентификатор());
		СкопироватьПодчиненныеСтроки(ТекСтрока, НоваяСтрока);
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	Если ТекущиеДанные.УровеньСтроки = 0 Тогда    	
		Отказ = Истина;    	
	КонецЕсли; 
	
	Если Не Отказ Тогда   		
		НайтиУдалитьСтрокиТаблицы(ТекущиеДанные.ПолучитьИдентификатор()); 		
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(ТекущиеДанные, 
																КэшЗначений.ИзмеренияДоп, 
																КэшЗначений.НастройкиИзмерений);
	КонецЕсли;
	
	мТекФункции.ФункцияСумма      = ТекущиеДанные.ФункцияСумма;
	мТекФункции.ФункцияКоличество = ТекущиеДанные.ФункцияКоличество;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
		ЗаполнитьСтрокуЗависимыхОборотов(ТекущиеДанные.ПолучитьИдентификатор());	
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры
             
&НаКлиенте
Процедура ДеревоЗависимостейСтатьяОборотовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(ТекущиеДанные, 
																КэшЗначений.ИзмеренияДоп, 
																КэшЗначений.НастройкиИзмерений);
	ИзменениеСтатьиОборотов(ТекущиеДанные.ПолучитьИдентификатор(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейФункцияСуммаПриИзменении(Элемент)
	
	ПроверитьКонтекстФункции("ФункцияСумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗависимостейФункцияКоличествоПриИзменении(Элемент)
	
	ПроверитьКонтекстФункции("ФункцияКоличество");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ПодключаемыеКомандыЭлементовТаблицФормы

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(ИмяПоля, КэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(ТекущиеДанные, СтандартнаяОбработка, ИмяПоля);	
	Иначе	
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры
	
#КонецОбласти 

&НаКлиенте
Процедура КомандаНастройкиПериода(Команда)
	
	ПараметрыПередачи = Новый Структура(); 
	ПараметрыПередачи.Вставить("ДатаНачала", 	Объект.ДатаНачала);
	ПараметрыПередачи.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	ПараметрыПередачи.Вставить("Контекст", 		УникальныйИдентификатор);
	
	бит_ОбщегоНазначенияКлиент.ВыбратьПериод(ПараметрыПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУровеньВниз(Команда)
	
	ТекущаяСтрока   = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено 
		  Тогда
		  
	    РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
		Если РодительСтроки = Неопределено Тогда
			РодительСтроки = ДеревоЗависимостей;
		КонецЕсли;	
		
		КоллекцияРодитель = РодительСтроки.ПолучитьЭлементы();
		Если КоллекцияРодитель.Количество()>=2  Тогда
		
			ТекущийИндекс = КоллекцияРодитель.Индекс(ТекущаяСтрока);
			ТекущийИндекс = ТекущийИндекс-1;
			
			Если ТекущийИндекс >= 0 Тогда
			  	
			  СкопироватьИерархию(КоллекцияРодитель[ТекущийИндекс],ТекущаяСтрока);
		      КоллекцияРодитель.Удалить(КоллекцияРодитель.Индекс(ТекущаяСтрока));
			  
			  Модифицированность = Истина;

			КонецЕсли; 
			
		КонецЕсли; 
		 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУровеньВверх(Команда)
	
	ТекущаяСтрока   = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
	Если ТекущаяСтрока <> Неопределено 
		 И РодительСтроки <> Неопределено Тогда
		 
		 Если РодительСтроки.УровеньСтроки > 0 Тогда
			 
			РодительРодителя = РодительСтроки.ПолучитьРодителя();

			Если РодительРодителя <> Неопределено  Тогда

				ИндексВставки = РодительРодителя.ПолучитьЭлементы().Индекс(РодительСтроки)+1;
				СкопироватьИерархию(РодительРодителя, ТекущаяСтрока, ИндексВставки, Истина);

			Иначе	

				ИндексВставки = ДеревоЗависимостей.ПолучитьЭлементы().Индекс(РодительСтроки)+1;			
				СкопироватьИерархию( ДеревоЗависимостей, ТекущаяСтрока, ИндексВставки, Истина);

			КонецЕсли; 

			КоллекцияРодитель = РодительСтроки.ПолучитьЭлементы();
			КоллекцияРодитель.Удалить(КоллекцияРодитель.Индекс(ТекущаяСтрока));
			
			Модифицированность = Истина;

		 КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьТабЧасть(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьИзменениеТабличнойЧасти", ЭтотОбъект);
	
	ПараметрыФормы = ПараметрыИзмененияТаблицыДокумента();
	ОткрытьФорму("Обработка.бит_ИзменениеТабличнойЧастиДокументаБюджетирования.Форма", 
		ПараметрыФормы, ЭтотОбъект,,,,Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура РедактированиеПериодаЗавершение(ПериодРезультат, ДополнительныеДанные)

	Если ПериодРезультат <> Неопределено Тогда
	
		Объект.ДатаНачала    = ПериодРезультат.ДатаНачала;
		Объект.ДатаОкончания = ПериодРезультат.ДатаОкончания;
		
		ЭтотОбъект.Модифицированность = Истина; 		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений()

	КэшЗначений = Новый Структура;
		
	// Пустая пользовательская функция.
	КэшЗначений.Вставить("ПустаяФункция", Справочники.бит_ПользовательскиеФункции.ПустаяСсылка());	
	
	// Настройки из модуля объекта.
	КэшЗначений.Вставить("Измерения",			бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Произвольные"  , "Синоним"));
	КэшЗначений.Вставить("ИзмеренияДоп",		бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним"));
	КэшЗначений.Вставить("НастройкиИзмерений",	бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	                 	      
КонецПроцедуры

&НаСервере
Функция НайтиСтрокуДерева(ВеткаДерева, ИскомыйИД)

	Результат = Неопределено;
	
	Для каждого СтрокаДерева Из ВеткаДерева Цикл
		
		Если СтрокаДерева.ИД = ИскомыйИД Тогда
			Результат = СтрокаДерева.ПолучитьИдентификатор();
			Прервать;
		Иначе	
			ВеткаДерева = СтрокаДерева.ПолучитьЭлементы();
			Результат = НайтиСтрокуДерева(ВеткаДерева, ИскомыйИД);
			Если Результат <> Неопределено Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтруктурыРеквизитов()
 
 	Измерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все", "имя");
	РеквизитыСтроки   = Новый Структура;
	РеквизитыРодителя = Новый Структура;
	
	// Измерения бюджетирования.
	Для каждого КлючИЗначение Из Измерения Цикл
		
		ИмяИзмерения = КлючИЗначение.Ключ;
		
		Если ИмяИзмерения = "Сценарий" Тогда		
			Продолжить;  		
		КонецЕсли; 
		
		РеквизитыРодителя.Вставить(ИмяИзмерения,ИмяИзмерения);
		РеквизитыСтроки.Вставить(ИмяИзмерения	,ИмяИзмерения + "_Зависимый");
		       	
	КонецЦикла; 
	
	// Специфические реквизиты зависимых оборотов.
	РеквизитыСтроки.Вставить("ПрофильРаспределения",	"ПрофильРаспределения");
	РеквизитыСтроки.Вставить("КоэффициентКоличество",	"КоэффициентКоличество");
	РеквизитыСтроки.Вставить("КоэффициентСумма",		"КоэффициентСумма");
	РеквизитыСтроки.Вставить("РеквизитКоличество",		"РеквизитКоличество");
	РеквизитыСтроки.Вставить("РеквизитСумма",			"РеквизитСумма");
	РеквизитыСтроки.Вставить("ФункцияСумма",			"ФункцияСумма");
	РеквизитыСтроки.Вставить("ФункцияКоличество",		"ФункцияКоличество");
	РеквизитыСтроки.Вставить("УчетСумма",				"УчетСумма");
	РеквизитыСтроки.Вставить("УчетКоличество",			"УчетКоличество");
	
КонецПроцедуры

&НаСервере
Процедура ОФормитьТаблицу(ПрефиксТаблицы, СтатьяОборотов = Неопределено) 
	
	Если СтатьяОборотов = Неопределено Тогда
	    // Формирование массива статей, по которым нужно добавить элементы УО.
		ТаблицаЗо = Объект.ЗависимыеОбороты.Выгрузить();
		МассивСтатей = ТаблицаЗо.ВыгрузитьКолонку("СтатьяОборотов");
		Для каждого ЭлементМассиваЗависимых Из ТаблицаЗо.ВыгрузитьКолонку("СтатьяОборотов_Зависимый") Цикл
			МассивСтатей.Добавить(ЭлементМассиваЗависимых);  		
		КонецЦикла;
		бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСтатей);
		
		СписокСтатей.ЗагрузитьЗначения(МассивСтатей);
	Иначе // Работаем только с одной статьей оборотов.		
		
		МассивСтатей = Новый Массив;
		
		НайденноеЗначение = СписокСтатей.НайтиПоЗначению(СтатьяОборотов);
		Если НайденноеЗначение = Неопределено Тогда 			
			
			МассивСтатей.Добавить(СтатьяОборотов);
			СписокСтатей.Добавить(СтатьяОборотов);
		
		КонецЕсли;  		
		
	КонецЕсли;	
	
	ПараметрыОформления = бит_РаботаСДиалогамиСервер.НовыеПараметрыОформленияСтатей();
	ПараметрыОформления.ПрефиксТаблицы = ПрефиксТаблицы;
	бит_РаботаСДиалогамиСервер.ОформитьТаблицуПоСтатьямОборотов(УсловноеОформление, МассивСтатей, ПараметрыОформления);
		
КонецПроцедуры

// Процедура выполняет проверку пригодности использования пользовательской функции 
// для расчета зависимых оборотов. 
// 
// Параметры:
//  ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ПроверитьКонтекстФункции(ИмяРеквизита)
	
	ТекущиеДанные = Элементы.ДеревоЗависимостей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные[ИмяРеквизита]) Тогда 
		
		Если Не КонтекстФункцииКорректен(ТекущиеДанные.ПолучитьИдентификатор(), ИмяРеквизита) Тогда
			
			ТекущиеДанные[ИмяРеквизита] = мТекФункции[ИмяРеквизита];
			
			ТекстСообщения = НСтр("ru='Для подбора доступны только пользовательские функции контекста ""Зависимые обороты"".';
								  |en='Only user functions of the context ""Dependent turnover"" are available for selection'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		КонецЕсли;
		
	КонецЕсли; 
	
	мТекФункции[ИмяРеквизита] = ТекущиеДанные[ИмяРеквизита];
	
КонецПроцедуры

// Процедура копирует строку дерева значений вместе с подчиненными строками. Рекурсия.
// 
// Параметры:
//  СтрокаРодитель    - СтрокаДереваЗначений - Строка дерева, которой подчиняется строка копирования.
//  СтрокаКопирования - СтрокаДереваЗначений - копируемая строка дерева.
// 
&НаКлиенте
Процедура СкопироватьИерархию(СтрокаРодитель,СтрокаКопирования, ИндексВставки = Неопределено, УровеньВверх = Ложь)
	
	Если ТипЗнч(ИндексВставки) = Тип("Число") Тогда
		НоваяСтрока = СтрокаРодитель.ПолучитьЭлементы().Вставить(ИндексВставки);
	Иначе	
		НоваяСтрока = СтрокаРодитель.ПолучитьЭлементы().Добавить();
	КонецЕсли;
	
	Если СтрокаКопирования.УровеньСтроки = 2 И УровеньВверх Тогда 
		
		СвойстваИсключения = "РеквизитСумма, РеквизитКоличество, КоэффициентСумма, КоэффициентКоличество, ФункцияСумма, ФункцияКоличество";
		
	Иначе
		
		СвойстваИсключения = "";
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКопирования,,СвойстваИсключения);
	
	Если УровеньВверх Тогда
		НоваяСтрока.УровеньСтроки = СтрокаКопирования.УровеньСтроки - 1;
	Иначе
		НоваяСтрока.УровеньСтроки = СтрокаКопирования.УровеньСтроки + 1;
	КонецЕсли;

	Для каждого СтрокаПодчиненная Из СтрокаКопирования.ПолучитьЭлементы() Цикл
		
		СкопироватьИерархию(НоваяСтрока, СтрокаПодчиненная,,УровеньВверх);
		
	КонецЦикла; 
	
	НайтиУдалитьСтрокиТаблицы(СтрокаКопирования.ПолучитьИдентификатор());
	
	ЗаполнитьСтрокуЗависимыхОборотов(НоваяСтрока.ПолучитьИдентификатор());

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

&НаСервере
Процедура СинхронизироватьРеквизитыТаблицыИДерева(ИдТекущейСтрокиТч, ИдТекущейСтрокиДерева, Реквизиты, Приемник)
	
	ТекущиеДанныеТч 	= Объект.ЗависимыеОбороты.НайтиПоИдентификатору(ИдТекущейСтрокиТч);	
	ТекущиеДанныеДерева = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекущейСтрокиДерева);	
	Если ТекущиеДанныеТч = Неопределено ИЛИ ТекущиеДанныеДерева = Неопределено Тогда 		
		Возврат;    		
	КонецЕсли;
	
 	Для каждого КлючИЗначение Из Реквизиты Цикл
	 
		ИмяРеквДерево  = КлючИЗначение.Ключ;
	 	ИмяРеквТаблица = КлючИЗначение.Значение;
	 
	 	ЗначениеТаблица = ТекущиеДанныеТч[ИмяРеквТаблица];
	 	ЗначениеДерево  = ТекущиеДанныеДерева[ИмяРеквДерево];
		
		Если ЗначениеТаблица <> ЗначениеДерево Тогда
		 
		 	Если Приемник = "Таблица" Тогда
			 	ТекущиеДанныеТч[ИмяРеквТаблица] 	= ЗначениеДерево;
		 	ИначеЕсли Приемник = "Дерево" Тогда	
			 	ТекущиеДанныеДерева[ИмяРеквДерево]  = ЗначениеТаблица;
		 	КонецЕсли; 
		 
	 	КонецЕсли; 
	 
 	КонецЦикла; 	
 
КонецПроцедуры

&НаСервере
Процедура ИзменениеСтатьиОборотов(Знач ИдТекущейСтроки, Знач ЗаполнятьПоУмолчанию, НастройкиСтатейОборотов = Неопределено, ПрименятьОформление = Истина)

	ТекущиеДанныеДерева = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекущейСтроки);	
	Если ТекущиеДанныеДерева = Неопределено Тогда 		
		Возврат;    		
	КонецЕсли;
	
	СтатьяОборотов  = ТекущиеДанныеДерева.СтатьяОборотов;
	НастройкиСтатьи = НастройкиСтатьиОборотов(СтатьяОборотов, НастройкиСтатейОборотов);
	
	ТекущиеДанныеДерева.УчетСумма      = НастройкиСтатьи.Учет_Сумма;
	ТекущиеДанныеДерева.УчетКоличество = НастройкиСтатьи.Учет_Количество;
	
	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		
		ТекущиеДанныеДерева.Кодификатор = ?(ЗначениеЗаполнено(НастройкиСтатьи.Кодификатор)
											,НастройкиСтатьи.Кодификатор
											,НастройкиСтатьи.Код);
		
		ТекущиеДанныеДерева.ТипСтатьиОборотов = НастройкиСтатьи.ТипСтатьи;
		
		Если ТекущиеДанныеДерева.ПолучитьРодителя().ПолучитьРодителя() <> Неопределено Тогда
			Если ЗаполнятьПоУмолчанию Тогда

				Если ТекущиеДанныеДерева.УчетКоличество Тогда
					ТекущиеДанныеДерева.КоэффициентКоличество = Объект.КоэффициентКоличество;
					ТекущиеДанныеДерева.РеквизитКоличество = Перечисления.бит_РеквизитыДляРасчетаЗависимостей.Количество;
				Иначе
					ТекущиеДанныеДерева.КоэффициентКоличество = 0;
					ТекущиеДанныеДерева.РеквизитКоличество = Перечисления.бит_РеквизитыДляРасчетаЗависимостей.ПустаяСсылка();
				КонецЕсли;
				
				Если ТекущиеДанныеДерева.УчетСумма Тогда
					ТекущиеДанныеДерева.КоэффициентСумма = Объект.КоэффициентСумма;
					ТекущиеДанныеДерева.РеквизитСумма = Перечисления.бит_РеквизитыДляРасчетаЗависимостей.Сумма
				Иначе
					ТекущиеДанныеДерева.КоэффициентСумма = 0;
					ТекущиеДанныеДерева.РеквизитСумма = Перечисления.бит_РеквизитыДляРасчетаЗависимостей.ПустаяСсылка();
				КонецЕсли;
								
			КонецЕсли; 
		КонецЕсли; 
		
		бит_МеханизмДопИзмерений.ИнициализироватьЗначенияДопИзмерений(ТекущиеДанныеДерева, КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
		
		бит_Бюджетирование.УстановитьИспользованиеАналитики(ТекущиеДанныеДерева, НастройкиСтатьи, КэшЗначений.Измерения);
		
	КонецЕсли;
	
	Если ПрименятьОформление Тогда
		ОФормитьТаблицу("ДеревоЗависимостей", СтатьяОборотов);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НастройкиСтатьиОборотов(СтатьяОборотов, НастройкиСтатейОборотов)
	
	Если ТипЗнч(НастройкиСтатейОборотов) = Тип("Соответствие") Тогда
		НастройкиСтатьи = НастройкиСтатейОборотов.Получить(СтатьяОборотов);
		Если НастройкиСтатьи <> Неопределено Тогда
			Возврат НастройкиСтатьи;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.бит_СтатьиОборотов.ПолучитьНастройки(СтатьяОборотов);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоПоРодителю(ИдТекСтрокиДерева, ТекИД_Родитель, НастройкиСтатейОборотов, ПрименятьОформление = Истина)

	// Текущая строка дерева.
	СтрокаВерх = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекСтрокиДерева);
	Если СтрокаВерх = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	ВеткаДереваВерх = СтрокаВерх.ПолучитьЭлементы();
		
	// Добавление подчиненных строк.
	НайденныеСтрокиЗвОб = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("ИД_Родитель", ТекИД_Родитель));
	Если НайденныеСтрокиЗвОб.Количество() > 0 Тогда
		
		НовыйУровень = СтрокаВерх.УровеньСтроки + 1;
					
		Для каждого СтрокаТаблицыЗвОб Из НайденныеСтрокиЗвОб Цикл
			
			СтрокаДерева 	 = ВеткаДереваВерх.Добавить();
			ТекИдентификатор = СтрокаДерева.ПолучитьИдентификатор();
			
			СтрокаДерева.УровеньСтроки = НовыйУровень;
			СтрокаДерева.ИД 		   = СтрокаТаблицыЗвОб.ИД;
			СинхронизироватьРеквизитыТаблицыИДерева(СтрокаТаблицыЗвОб.ПолучитьИдентификатор(), ТекИдентификатор, РеквизитыСтроки, "Дерево");
			
			// Если есть следующий уровень подчиненных.
			НайденныеСтрокиРодителиЗвОб = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("ИД_Родитель", СтрокаТаблицыЗвОб.ИД));
			Если НайденныеСтрокиРодителиЗвОб.Количество() > 0 Тогда     			
				
				СтрокаДерева.ЕстьПодчиненные = Истина;
				
				СтрокаРодительЗаОб = НайденныеСтрокиРодителиЗвОб[0];
				СинхронизироватьРеквизитыТаблицыИДерева(СтрокаРодительЗаОб.ПолучитьИдентификатор(), ТекИдентификатор, РеквизитыРодителя, "Дерево");
				ИзменениеСтатьиОборотов(ТекИдентификатор, Ложь,, ПрименятьОформление);
				
				ЗаполнитьДеревоПоРодителю(ТекИдентификатор, СтрокаРодительЗаОб.Ид_Родитель, НастройкиСтатейОборотов, ПрименятьОформление);
				
			Иначе
				
				ИзменениеСтатьиОборотов(ТекИдентификатор, Ложь, НастройкиСтатейОборотов, ПрименятьОформление);
				
			КонецЕсли; 			
	
		КонецЦикла; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоЗависимостей()
	
	ДеревоЗависимостей.ПолучитьЭлементы().Очистить();
	
	// Корень дерева.
	КореньДерева = ДеревоЗависимостей.ПолучитьЭлементы();
	
	// Нулевая строка "Статьи".
	СтрокаВерх = КореньДерева.Добавить();	
	СтрокаВерх.Кодификатор = "Статьи";
 	ВеткаДереваВерх = СтрокаВерх.ПолучитьЭлементы();
	
	ТаблицаСтрокЗо          = Объект.ЗависимыеОбороты.Выгрузить();
	ИдСтрок 	            = ТаблицаСтрокЗо.ВыгрузитьКолонку("ИД");
	СтатьиОборотов          = ТаблицаСтрокЗо.ВыгрузитьКолонку("СтатьяОборотов");
	ЗависимыеСтатьиОборотов = ТаблицаСтрокЗо.ВыгрузитьКолонку("СтатьяОборотов_Зависимый");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтатьиОборотов, ЗависимыеСтатьиОборотов);
	
	ТаблицаСтрокЗо.Свернуть("ИД_Родитель");
	
	ИдРодителей             = ТаблицаСтрокЗо.ВыгрузитьКолонку("ИД_Родитель");
	НастройкиСтатейОборотов = Справочники.бит_СтатьиОборотов.НастройкиСтатейОборотов(СтатьиОборотов);
	
	// Для всех строк-родителей. 
	Для каждого ИдРодитель Из ИдРодителей Цикл
		
		// Если строка подчинена не "нулевой строке".
		Если ИдСтрок.Найти(ИдРодитель) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Запись строк дерева первого уровня.
		НайденныеСтрокиРодителиЗвОб = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("ИД_Родитель", ИдРодитель));
		Если НайденныеСтрокиРодителиЗвОб.Количество() > 0 Тогда
		    СтрокаРодительЗаОб = НайденныеСтрокиРодителиЗвОб[0];
			
			СтрокаДерева 	   = ВеткаДереваВерх.Добавить();
			ТекИдентификатор   = СтрокаДерева.ПолучитьИдентификатор();
			
			СтрокаДерева.УровеньСтроки   = 1;
			СтрокаДерева.ИД              = СтрокаРодительЗаОб.ИД_Родитель;
			СтрокаДерева.ЕстьПодчиненные = Истина;
			СинхронизироватьРеквизитыТаблицыИДерева(СтрокаРодительЗаОб.ПолучитьИдентификатор(), ТекИдентификатор, РеквизитыРодителя, "Дерево");
			ИзменениеСтатьиОборотов(ТекИдентификатор, Ложь, НастройкиСтатейОборотов, Ложь);
					
			ЗаполнитьДеревоПоРодителю(ТекИдентификатор, СтрокаРодительЗаОб.Ид_Родитель, НастройкиСтатейОборотов, Ложь);
		КонецЕсли;
			
	КонецЦикла;
	
	ОФормитьТаблицу("ДеревоЗависимостей");

КонецПроцедуры

// Процедура создает строку табличной части ЗависимыеОбороты 
// по данным строки дерева и по данным родителя строки дерева.
// 
// Параметры:
//  ИдТекСтрокиДерева - Число.
// 
&НаСервере
Процедура ЗаполнитьСтрокуЗависимыхОборотов(Знач ИдТекСтрокиДерева)
	
	// Текущая строка дерева.
	ТекСтрокаДерева = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекСтрокиДерева);
	Если ТекСтрокаДерева = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	ТекВеткаДерева = ТекСтрокаДерева.ПолучитьЭлементы();
	
	СтрокаРодитель = ТекСтрокаДерева.ПолучитьРодителя();
	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	

	Если ТекСтрокаДерева.УровеньСтроки > 1 Тогда
		 
		// Поиск по ИД или создание новой строки в табличной части ЗависимыеОбороты.
		 
		НайденныеСтрокиТаблицыЗо = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("ИД", ТекСтрокаДерева.ИД));
		Если НайденныеСтрокиТаблицыЗо.Количество() = 0 Тогда
			
			СтрокаТаблицыЗо = Объект.ЗависимыеОбороты.Добавить();
			СтрокаТаблицыЗо.ИД 			= ТекСтрокаДерева.ИД;
			СтрокаТаблицыЗо.ИД_Родитель = СтрокаРодитель.ИД;	 	
		 
		Иначе
			
			СтрокаТаблицыЗо = НайденныеСтрокиТаблицыЗо[0];	
			
		КонецЕсли;
		 		 
		// Синхронизация значений текущей строки дерева и строки табличной части.
		СинхронизироватьРеквизитыТаблицыИДерева(СтрокаТаблицыЗо.ПолучитьИдентификатор()
		 										, ТекСтрокаДерева.ПолучитьИдентификатор()
												, РеквизитыСтроки
												, "Таблица");
		 
		// Синхронизация значений строки-родителя дерева и строки табличной части.
		СинхронизироватьРеквизитыТаблицыИДерева(СтрокаТаблицыЗо.ПолучитьИдентификатор()
		 										, СтрокаРодитель.ПолучитьИдентификатор()
												, РеквизитыРодителя
												, "Таблица");
		 
	КонецЕсли; 	 
	 
	Для каждого СтрокаДерева Из ТекВеткаДерева Цикл  	 
		ЗаполнитьСтрокуЗависимыхОборотов(СтрокаДерева.ПолучитьИдентификатор());  	 
	КонецЦикла; 
	 
КонецПроцедуры

// Процедура выполняет поиск строк табличной части ЗависимыеОбороты
// ,соответствующей строке дерева значений и удаляет найденные строки.
// 
// Параметры:
//  ИдТекСтрокиДерева - Число.
// 
&НаСервере
Процедура НайтиУдалитьСтрокиТаблицы(Знач ИдТекСтрокиДерева)

	// Текущая строка дерева.
	СтрокаВерх = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекСтрокиДерева);
	Если СтрокаВерх = Неопределено Тогда
		Возврат;		
	КонецЕсли;
		
	НайденныеСтрокиТаблицыЗо = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("ИД", СтрокаВерх.ИД));
	Для каждого СтрокаТаблицаЗо Из НайденныеСтрокиТаблицыЗо Цикл
		ИндексУдаляемой = Объект.ЗависимыеОбороты.Индекс(СтрокаТаблицаЗо);
		Объект.ЗависимыеОбороты.Удалить(ИндексУдаляемой);	
	КонецЦикла;
	
	Для каждого СтрокаДерева Из СтрокаВерх.ПолучитьЭлементы() Цикл 		
		 НайтиУдалитьСтрокиТаблицы(СтрокаДерева.ПолучитьИдентификатор()); 		
	КонецЦикла;	

КонецПроцедуры

// Устанавливает Ид в строке таб. части БДДС.
// 
// Параметры:
//  ИдТекСтрокиДерева - Число
// 
&НаСервере
Процедура УстановитьНовыйИд(Знач ИдТекСтрокиДерева)
	
	ТекущаяСтрока = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекСтрокиДерева);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ТекущаяСтрока.ИД = Строка(Новый УникальныйИдентификатор);
	Для каждого СтрокаДерева Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
		УстановитьНовыйИД(СтрокаДерева.ПолучитьИдентификатор());
	КонецЦикла; 
	 
КонецПроцедуры

// Функция проверяет контекст функции.
// 
// Параметры:
//  ИдТекСтрокиДерева - Число
//  ИмяРеквизита	  - Строка
//  
// Возвращаемое значение:
//   Булево
// 
&НаСервере
Функция КонтекстФункцииКорректен(Знач ИдТекСтрокиДерева, Знач ИмяРеквизита)

	Результат = Ложь;
	
	ТекущаяСтрока = ДеревоЗависимостей.НайтиПоИдентификатору(ИдТекСтрокиДерева);
	Если ТекущаяСтрока <> Неопределено Тогда
		Результат = ТекущаяСтрока[ИмяРеквизита].Контекст = Перечисления.бит_КонтекстыВыполненияПользовательскихФункций.ЗависимыеОбороты;			
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ПерейтиКРедактированиюКоэффицентов()

	Оповещение = Новый ОписаниеОповещения("ПерейтиКРедактированиюКоэффицентовЗавершение", ЭтотОбъект); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КоэффициентКоличество"	   , Объект.КоэффициентКоличество);
	ПараметрыФормы.Вставить("КоэффициентСумма"		   , Объект.КоэффициентСумма);
	ПараметрыФормы.Вставить("ТочностьКоэффициентаСуммы", Объект.ТочностьКоэффициентаСуммы);
	ОткрытьФорму("Документ.бит_УстановкаЗависимыхОборотов.Форма.Коэффициенты", ПараметрыФормы, ЭтотОбъект,,,, Оповещение);

КонецПроцедуры 

// Процедура окончание процедуры "ПерейтиКРедактированиюКоэффицентов". 
//
// Параметры:
//  Результат - Структура.
//  ДополнительныеПараметры - Структура.
//
&НаКлиенте 
Процедура ПерейтиКРедактированиюКоэффицентовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	
	ПерейтиКРедактированиюКоэффицентовЗавершениеНаСервере(Результат);
	Элементы.ДеревоЗависимостей.Развернуть(ДеревоЗависимостей.ПолучитьЭлементы()[0].ПолучитьИдентификатор(), Истина);
	
КонецПроцедуры


// Процедура окончание процедуры "ПерейтиКРедактированиюКоэффицентов". 
//
// Параметры:
//  Результат - Структура.
//  ДополнительныеПараметры - Структура.
//
&НаСервере 
Процедура ПерейтиКРедактированиюКоэффицентовЗавершениеНаСервере(Результат)
		
	ЗаполнитьЗначенияСвойств(Объект, Результат);
	Модифицированность = Истина;
	СформироватьНадписьКоэффициенты();
	
	ПерезаполнитьДеревоЗависимостей();    
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДеревоЗависимостей()
	
	Для каждого СтрокаЗависимых Из Объект.ЗависимыеОбороты Цикл
		Если СтрокаЗависимых.УчетКоличество Тогда
			СтрокаЗависимых.КоэффициентКоличество = Объект.КоэффициентКоличество;
		Иначе
			СтрокаЗависимых.КоэффициентКоличество = 0;
		КонецЕсли;
		Если СтрокаЗависимых.УчетСумма Тогда
			СтрокаЗависимых.КоэффициентСумма = Объект.КоэффициентСумма;
		Иначе
			СтрокаЗависимых.КоэффициентСумма = 0;
		КонецЕсли;
	КонецЦикла; 
	ОбновитьДеревоЗависимостей();

КонецПроцедуры

&НаСервере
Процедура СформироватьНадписьКоэффициенты()

	ФорматКоэффициентаСуммы = Документы.бит_УстановкаЗависимыхОборотов.ФорматКоэффициентаСуммы(Объект.ТочностьКоэффициентаСуммы, Истина); 
	Шаблон = НСтр("ru='Коэффициенты: количество %1; сумма %2';en='Coefficients: number %1; the sum of %2'");	
	НадписьКоэффициенты = СтрШаблон(Шаблон, Формат(Объект.КоэффициентКоличество, "ЧЦ=10; ЧДЦ=4; ЧН=0,0000"),
								Формат(Объект.КоэффициентСумма, ФорматКоэффициентаСуммы));
	
КонецПроцедуры 

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьСостояниеДокумента();
	ЗаполнитьДобавленныеКолонкиТаблиц();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	ЭтоПереносНаДругойСценарий = (Объект.ВидОперации =
		ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкиЗависимыхОборотов.ОтражениеНаДругомСценарии"));
	Элементы.Сценарий.АвтоОтметкаНезаполненного             = ЭтоПереносНаДругойСценарий;
	Если НЕ Элементы.Сценарий.АвтоОтметкаНезаполненного Тогда
		Элементы.Сценарий.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	Элементы.ЗависимыйСценарий.Видимость                    = ЭтоПереносНаДругойСценарий;
	Элементы.ЗависимыйСценарий.АвтоОтметкаНезаполненного    = ЭтоПереносНаДругойСценарий;
	Элементы.КартинкаИнформация.Видимость                   = ЭтоПереносНаДругойСценарий;
	Элементы.ДекорацияПредупреждениеОВидеОперации.Видимость = ЭтоПереносНаДругойСценарий;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СведеньяОСтатьяхОборотов = ПолучитьСведенияОСтатьяхОборотов(
					ОбщегоНазначения.ВыгрузитьКолонку(Объект.ЗависимыеОбороты, "СтатьяОборотов_Зависимый", Истина));
					
	Для каждого СтрокаТаблицы Из Объект.ЗависимыеОбороты Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтатьяОборотов_Зависимый) Тогда
			СтрокаТаблицы.УчетКоличество= Ложь;
			СтрокаТаблицы.УчетСумма		= Ложь;
		Иначе
			СведенияОСтатье = СведеньяОСтатьяхОборотов.Получить(СтрокаТаблицы.СтатьяОборотов_Зависимый);
			Если СведенияОСтатье <> Неопределено Тогда
				СтрокаТаблицы.УчетКоличество= СведенияОСтатье.Учет_Количество;
				СтрокаТаблицы.УчетСумма		= СведенияОСтатье.Учет_Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСведенияОСтатьяхОборотов(Знач СписокСтатей)
	
	ИменаРеквизитов = "Учет_Количество, Учет_Сумма";
	
	СписокСтатейБезПустыхЗначений = ОбщегоНазначения.СкопироватьРекурсивно(СписокСтатей);
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СписокСтатейБезПустыхЗначений,
		Справочники.бит_СтатьиОборотов.ПустаяСсылка());
	СведеньяОСтатьяхОборотов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокСтатейБезПустыхЗначений, ИменаРеквизитов);
	
	Возврат СведеньяОСтатьяхОборотов;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьоповещениеОбИзмененииСтатьиОборотов(СтатьяОборотов);
	
	ПараметрыОтбора = Новый Структура("СтатьяОборотов_Зависимый", СтатьяОборотов);
	СтрокиДляАктуализации = Объект.ЗависимыеОбороты.НайтиСтроки(ПараметрыОтбора);
	Если СтрокиДляАктуализации.Количество() > 0 Тогда
		СведенияОСтатье = ПолучитьСведенияОСтатьеОборотов(СтатьяОборотов);
		Для каждого СтрокаТаблицы Из СтрокиДляАктуализации Цикл
			Если СведенияОСтатье <> Неопределено Тогда
				СтрокаТаблицы.УчетКоличество= СведенияОСтатье.Учет_Количество;
				СтрокаТаблицы.УчетСумма		= СведенияОСтатье.Учет_Сумма;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСведенияОСтатьеОборотов(Знач СтатьяОборотов)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяОборотов, "Учет_Количество, Учет_Сумма");
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ШрифтЗаголовка = ШрифтыСтиля.бит_ШрифтТекстаОбычныйПолужирный;
	
	// Нулевой уровень дерева.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостей");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Равно, 0);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтЗаголовка);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Первый уровень дерева.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКодификатор");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейТипСтатьиОборотов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейСтатьяОборотов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейПрофильРаспределения");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейЦФО");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Равно, 1);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтЗаголовка);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейПрофильРаспределения");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияКоличество");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Равно, 1);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	УстановитьУсловноеОфомлениеПоКоличествуИСумме();
	
	// Шрифт подчиненных строк.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКодификатор");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейТипСтатьиОборотов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейСтатьяОборотов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейПрофильРаспределения");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейЦФО");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейИД");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Больше, 1);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.ЕстьПодчиненные", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтЗаголовка);
	
	// Не указан реквизит суммы.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитСумма");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Больше, 1);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.КоэффициентСумма", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.РеквизитСумма", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	// Не указан реквизит количества.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитКоличество");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Больше, 1);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.КоэффициентКоличество", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.РеквизитКоличество", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	// Не указаны реквизит количества и суммы или функции количества и суммы.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияКоличество");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Больше, 1);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.КоэффициентСумма", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.КоэффициентКоличество", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.ФункцияСумма", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.ФункцияКоличество", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОфомлениеПоКоличествуИСумме()
	
	ПараметрыОформленияСкрытыхПолей = бит_РаботаСДиалогамиСервер.ПараметрыУсловногоОформленияНедоступныхПолейСтатейОборотов();
	ПараметрыОформленияСкрытыхПолей.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
	
	// Нет учета по сумме. 
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентСумма");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияСумма");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Больше, 1);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УчетСумма", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	Для каждого ПараметрОформления Из ПараметрыОформленияСкрытыхПолей Цикл
		ЭлементУО.Оформление.УстановитьЗначениеПараметра(ПараметрОформления.Ключ, ПараметрОформления.Значение);
	КонецЦикла;
	
	// Нет учета по количеству. 
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейРеквизитКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейКоэффициентКоличество");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоЗависимостейФункцияКоличество");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УровеньСтроки", ВидСравненияКомпоновкиДанных.Больше, 1);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоЗависимостей.УчетКоличество", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	Для каждого ПараметрОформления Из ПараметрыОформленияСкрытыхПолей Цикл
		ЭлементУО.Оформление.УстановитьЗначениеПараметра(ПараметрОформления.Ключ, ПараметрОформления.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматКоэффициентаСуммы()

	ФорматКоэффициентаСуммы = Документы.бит_УстановкаЗависимыхОборотов.ФорматКоэффициентаСуммы(Объект.ТочностьКоэффициентаСуммы); 
	Элементы.ДеревоЗависимостейКоэффициентСумма.Формат = ФорматКоэффициентаСуммы;
	Элементы.ЗависимыеОборотыКоэффициентСумма.Формат   = ФорматКоэффициентаСуммы;
	
	СформироватьНадписьКоэффициенты();

КонецПроцедуры

&НаСервере
Функция ПараметрыИзмененияТаблицыДокумента()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Команда",			"бит_УстановкаЗависимыхОборотов");
	ПараметрыФормы.Вставить("Объект",			Объект.Ссылка);
	ПараметрыФормы.Вставить("ИмяТабличнойЧасти","ЗависимыеОбороты");
	ПараметрыФормы.Вставить("ТабличнаяЧасть",	 
		ПоместитьВоВременноеХранилище(ЗависимыеОборотыТаблицей(РеквизитФормыВЗначение("ДеревоЗависимостей")),
										УникальныйИдентификатор));
		
	Возврат ПараметрыФормы;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗависимыеОборотыТаблицей(Дерево, ЗависимыеОборотыТаблицей = Неопределено)
	
	Если ЗависимыеОборотыТаблицей = Неопределено Тогда
		ЗависимыеОборотыТаблицей = Новый ТаблицаЗначений;
		Для каждого Колонка Из Дерево.Колонки Цикл
			ЗависимыеОборотыТаблицей.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		Если ЗначениеЗаполнено(СтрокаДерева.СтатьяОборотов) Тогда
			ЗаполнитьЗначенияСвойств(ЗависимыеОборотыТаблицей.Добавить(), СтрокаДерева);
		КонецЕсли;
		ЗависимыеОборотыТаблицей(СтрокаДерева, ЗависимыеОборотыТаблицей);
	КонецЦикла;
	
	Возврат ЗависимыеОборотыТаблицей;
	
КонецФункции

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ОбработатьИзменениеТабличнойЧасти(Результат, Дополнительно) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ИмяТабличнойЧасти		  = Результат.ИмяТабличнойЧасти;
	АдресВоВременномХранилище = Результат.АдресВоВременномХранилище;
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресВоВременномХранилище) Тогда
		Возврат;
	КонецЕсли; 
	
	ОбработатьИзменениеТабличнойЧастиНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеТабличнойЧастиНаСервере(Знач ПараметрыОповещения)

	ИмяТабличнойЧасти		  = ПараметрыОповещения.ИмяТабличнойЧасти;
	АдресВоВременномХранилище = ПараметрыОповещения.АдресВоВременномХранилище;
		
	Модифицированность = Истина;
	ДанныеЗаполнения   = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	ЗаполнитьДанныеДереваПоИзменениямТабличнойЧасти(ДеревоЗависимостей, ДанныеЗаполнения);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДереваПоИзменениямТабличнойЧасти(ДеревоЗависимостей, ДанныеЗаполнения)
	
	Для каждого ЭлементДерева Из ДеревоЗависимостей.ПолучитьЭлементы() Цикл
		ИдЭлемента = ЭлементДерева.ИД;
		Если НЕ ПустаяСтрока(ИдЭлемента) Тогда
			СтрокаЗаполнения = ДанныеЗаполнения.Найти(ИдЭлемента, "ИД");
			Если СтрокаЗаполнения <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЭлементДерева, СтрокаЗаполнения);
				ЗаполнитьСтрокуЗависимыхОборотов(ЭлементДерева.ПолучитьИдентификатор());
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьДанныеДереваПоИзменениямТабличнойЧасти(ЭлементДерева, ДанныеЗаполнения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СпозиционироватьсяНаСтрокеЗависимостей()
	
	КлючАвтопозиционирования = Параметры.КлючАвтопозиционирования;
	Если КлючАвтопозиционирования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтатьи = Новый Структура;
	ОтборСтатьи.Вставить("СтатьяОборотов", КлючАвтопозиционирования.СтатьяОборотов);
	СтрокиСтатей = бит_РаботаСКоллекциямиКлиентСервер.НайтиСтрокиДанныхФормыДерева(ДеревоЗависимостей.ПолучитьЭлементы(),
																					ОтборСтатьи, Истина);
	ОтборЗависимойСтатьи = Новый Структура;
	ОтборЗависимойСтатьи.Вставить("СтатьяОборотов", КлючАвтопозиционирования.СтатьяОборотов_Зависимый);
	Для каждого СтрокаСтатьи Из СтрокиСтатей Цикл
		СтрокаЗависимойСтатьи = бит_РаботаСКоллекциямиКлиентСервер.НайтиЭлементДерева(СтрокаСтатьи.ПолучитьЭлементы(),
																					ОтборЗависимойСтатьи);
		Если СтрокаЗависимойСтатьи <> Неопределено Тогда
			Элементы.ДеревоЗависимостей.ТекущаяСтрока = СтрокаЗависимойСтатьи.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
